> I think I found the issue. Wit the fix from [#1279](https://github.com/keycloak/terraform-provider-keycloak/pull/1279) I can do fine grained updates.
> 
> When I create the realm without explicit security defence settings via `terraform apply -auto-approve`:
> 
> resource "keycloak_realm" "test" {
>   realm   = "gh-1257"
>   enabled = true
> }
> I see the following:
> 
> ```
>   # keycloak_realm.test will be created
>   + resource "keycloak_realm" "test" {
>       + access_code_lifespan                     = (known after apply)
>       + access_code_lifespan_login               = (known after apply)
>       + access_code_lifespan_user_action         = (known after apply)
>       + access_token_lifespan                    = (known after apply)
>       + access_token_lifespan_for_implicit_flow  = (known after apply)
>       + action_token_generated_by_admin_lifespan = (known after apply)
>       + action_token_generated_by_user_lifespan  = (known after apply)
>       + browser_flow                             = (known after apply)
>       + client_authentication_flow               = (known after apply)
>       + client_session_idle_timeout              = (known after apply)
>       + client_session_max_lifespan              = (known after apply)
>       + direct_grant_flow                        = (known after apply)
>       + docker_authentication_flow               = (known after apply)
>       + duplicate_emails_allowed                 = (known after apply)
>       + edit_username_allowed                    = (known after apply)
>       + enabled                                  = true
>       + first_broker_login_flow                  = (known after apply)
>       + id                                       = (known after apply)
>       + internal_id                              = (known after apply)
>       + login_with_email_allowed                 = (known after apply)
>       + oauth2_device_code_lifespan              = (known after apply)
>       + oauth2_device_polling_interval           = (known after apply)
>       + offline_session_idle_timeout             = (known after apply)
>       + offline_session_max_lifespan             = (known after apply)
>       + offline_session_max_lifespan_enabled     = false
>       + organizations_enabled                    = false
>       + realm                                    = "gh-1257"
>       + refresh_token_max_reuse                  = 0
>       + registration_allowed                     = (known after apply)
>       + registration_email_as_username           = (known after apply)
>       + registration_flow                        = (known after apply)
>       + remember_me                              = (known after apply)
>       + reset_credentials_flow                   = (known after apply)
>       + reset_password_allowed                   = (known after apply)
>       + revoke_refresh_token                     = false
>       + ssl_required                             = "external"
>       + sso_session_idle_timeout                 = (known after apply)
>       + sso_session_idle_timeout_remember_me     = (known after apply)
>       + sso_session_max_lifespan                 = (known after apply)
>       + sso_session_max_lifespan_remember_me     = (known after apply)
>       + user_managed_access                      = false
>       + verify_email                             = (known after apply)
> 
>       + otp_policy (known after apply)
> 
>       + web_authn_passwordless_policy (known after apply)
> 
>       + web_authn_policy (known after apply)
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> keycloak_realm.test: Creating...
> keycloak_realm.test: Creation complete after 4s [id=gh-1257]
> 
> Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
> ```
> 
> When I now add the config:
> 
> resource "keycloak_realm" "test" {
>   realm   = "gh-1257"
>   enabled = true
> 
>   security_defenses {
>     headers {
>       x_frame_options = ""
>     }
>   }
> }
> I now see this when I run `terraform apply -auto-approve`
> 
> ```
> keycloak_realm.test: Refreshing state... [id=gh-1257]
> 
> Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
>   ~ update in-place
> 
> Terraform will perform the following actions:
> 
>   # keycloak_realm.test will be updated in-place
>   ~ resource "keycloak_realm" "test" {
>         id                                       = "gh-1257"
>         # (52 unchanged attributes hidden)
> 
>       ~ security_defenses {
>           ~ headers {
>               - x_frame_options                     = "SAMEORIGIN" -> null
>                 # (7 unchanged attributes hidden)
>             }
>         }
> 
>         # (3 unchanged blocks hidden)
>     }
> ```

Thanks for your quick response on the matter.

I noticed that you only addressed the security_defenses in your commit, whereas in the original post the issue was raised because several fields  (for example description) cannot be "unset" when using an empty string as the value.

Do you have any ideas on how your approach could be extended to address this issue in a more general way, rather than handling it on a per-field basis?

Thanks in advance